export interface Product {
    id: number;
    name: string;
    price: number;
    description: string;
  }
  
  export const products = [
    {
      id: 1,
      name: 'Apple iPhone 13 128GB',
      price: 295689,
      description: `Apple iPhone 13 получил дисплей 6.1 дюйма Super Retina XDR, который отличается невероятно высокой плотностью пикселей — фотографии, видео и текст выглядят поразительно четко. А благодаря уменьшенной площади камеры TrueDepth на дисплее теперь больше места для изображения.
   
      Apple разработали совершенно новую схему расположения камер и развернули объективы на 45 градусов. Благодаря этому внутри корпуса поместилась лучшая система двух камер с увеличенной матрицей широкоугольной камеры. Кроме того, освободилось место для системы оптической стабилизации изображения со сдвигом матрицы, и увеличилась скорость работы матрицы на сверхширокоугольной камере.
      
      Новая сверхширокоугольная камера видит больше деталей в темных областях снимка. Сверхширокоугольная камера также обеспечивает большое поле обзора, даже когда вы находитесь очень близко к объекту съемки. Поэтому вам не придется отступать назад, чтобы в кадр попало все, что нужно.
       
      Просто начните запись видео. Режим «Киноэффект» будет удерживать фокус на объекте съемки, создавая красивый эффект размытия вокруг него. Режим «Киноэффект» распознаёт, когда нужно перевести фокус на другого человека или объект, который появился в кадре. Теперь ваши видео будут смотреться как настоящее кино.`,
      image: '../assets/1.jpeg',
      image1: '../assets/1-1.jpeg',
      image2: '../assets/1-2.jpeg',
      image3: '../assets/1-3.jpeg',
      rating: 5,
      link: 'https://kaspi.kz/shop/p/apple-iphone-13-128gb-midnight-chernyi-102298404/?c=750000000'
    },
    {
      id: 2,
      name: 'Xiaomi Redmi 12',
      price: 72421,
      description: 'Смартфон Redmi 12 является достойным продолжением линейки Redmi и получил весьма привлекательные характеристики за скромную стоимость. Первое, что бросается в глаза – улучшенный большой FHD+ экран.',
      image: '../assets/2.jpeg',
      image1: '../assets/2-1.jpeg',
      image2: '../assets/2-2.jpeg',
      image3: '../assets/2-3.jpeg',
      rating: 4,
      link: 'https://kaspi.kz/shop/p/xiaomi-redmi-12-4g-8-gb-256-gb-chernyi-110918152/?c=750000000'
    },
    {
      id: 3,
      name: 'Apple iPhone 14 128Gb',
      price: 324986,
      description: 'Более емкий аккумулятор — 3279 мА*ч у 14, вместо3227 мА*ч 13ки. Сенсора iPhone 14 она более светосильная с диафрагмой f/1,5, а не как у 13 f/1,6. iPhone 14 оснащен программно-аппаратным инструментом Photonic Engine. Фотографии вечером или ночью на iPhone 14 выглядят лучше как по цвету, так и по детализации. Еще одним важным программным отличием iPhone 14 от iPhone 13 стала поддержка Action Mode для видео - улучшенной системы программной стабилизации изображения, используемой при съемке динамичных видео на бегу или для съемки быстро движущихся объектов. Но главное отличие спрятано во фронтальной камере iPhone 14. В отличие от всех предыдущих моделей iPhone, включая iPhone 13, она имеет автоматическую фокусировку - а это значит, что ваши селфи всегда будут в фокусе, а во время видеозвонков камера не будет терять фокус, если вы чуть-чуть отдалитесь от смартфона. У iPhone 14 больше графических ядер, чем у iPhone 13 - пять вместо четырех. Благодаря этому стала возможна реализация дополнительных программных возможностей, например Action Mode для видео и технологии Photonic Engine, использующей более сложные графические вычисления. В синтетическом тесте 3DMark Wild Life дополнительное графическое ядро дает прирост на уровне 1500 очков. Это значит, что iPhone 14 будет увереннее работать с тяжелыми приложениями, реже выгружать программы из памяти, быстрее переключаться между различными утилитами и меньше тормозить при большом количестве одновременно запущенных приложений. Как ни крути, но оперативной памяти никогда не бывает мало, а 4 Гб сейчас уже откровенно недостаточно. Это уровень смартфонов среднего класса, а никак не флагманов.',
      image: '../assets/3.jpeg',
      image1: '../assets/3-1.jpeg',
      image2: '../assets/3-2.jpeg',
      image3: '../assets/3-3.jpeg',
      rating: 5,
      link: 'https://kaspi.kz/shop/p/apple-iphone-14-128gb-chernyi-106363023/?c=750000000'
    },
    {
      id: 4,
      name: 'Apple iPhone 15 Pro Max 256Gb',
      price: 613594,
      description: `Apple iPhone 15 Pro Max - сверхпрочный флагман, изготовленный из титана. За бескомпромиссную производительность смартфона отвечает новейший чип Apple A17 Pro. Устройство получило передовую систему камер, продуманную эргономику, обновленный дизайн и новую программируемую кнопку.
  
      Титановый корпус
      Титановый корпус стал одновременно и прочнее, и легче корпуса из стали. Внутренний структурный каркас iPhone из 100% переработанного алюминия. Вес флагмана составляет 221 г.
      
      Процессор
      Новый процессор A17 Pro получил на 10% увеличенную производительность по сравнению с предыдущим поколением. Его мощности с запасом хватает для выполнения самых сложных задач.
      
      Дисплей
      Дисплей диагональю 6.7" точно передаёт цвета и обеспечивает изображение с высочайшим уровнем детализации. Максимальная частота обновления экрана составляет 120 Гц, благодаря чему все переходы воспроизводятся плавно и без рывков. Стекло с покрытием Ceramic Shield надёжно защищает дисплей от царапин и сколов.`,
      image: '../assets/4.jpeg',
      image1: '../assets/4-1.jpeg',
      image2: '../assets/4-2.jpeg',
      image3: '../assets/4-3.jpeg',
      rating: 3,
      link: 'https://kaspi.kz/shop/p/apple-iphone-15-pro-max-256gb-seryi-113138420/?c=750000000'
    },
    {
      id: 5,
      name: 'Зарядное устройство Apple 20W ',
      price: 9111,
      description: `Компактный адаптер питания Apple USB-C мощностью 20 Вт позволяет быстро и эффективно заряжать устройства Apple. Совместим с любыми моделями Apple Watch, iPhone и iPod. 
   
      В комплекте кабель USB Type-C - Lightning 1 м.`,
      image: '../assets/5.jpeg',
      image1: '../assets/5-1.jpeg',
      image2: '../assets/5-2.jpeg',
      image3: '../assets/5-3.jpeg',
      rating: 5,
      link: 'https://kaspi.kz/shop/p/apple-20w-usb-c-power-adapter-apple-usb-c---lightning-1-m-101103131/?c=750000000'
    },
    {
      id: 6,
      name: 'LS Pro',
      price: 1280,
      description: `Беспроводная черная матовая (Soft-touch покрытие) блютуз (bluetooth) мышь c светодиодной RGB подсветкой
  
      Предельное разрешение сенсора составляет 1 600 DPI и работает по протоколу Bluetooth 5.1 или радиопротокол 2,4G — а это значит отсутствие помех, высокую отзывчивость и дальность до компьютера / ноутбука/телевизора до 10 метров, а так же возможность подключаться к устройствам где нет USB разъемов. Она абсолютно бесшумна - а это избавит вас от раздражающих щелчков и даст возможность работать в полной тишине. Так же отметим высокую автономность устройства — при полный зарядке за 2-3 часа мышка способна проработать до 20 дней или находиться в режиме ожидания до одного месяца благодаря умному режиму сна в который мышка входит самостоятельно при бездействии. Зарядка от любого устройства — ноутбука, компьютера, пауэр-банка займет всего 2 часа. Её эргономичная форма и Soft-touch покрытие (эластичное матовое мягкое покрытие) оставит только положительные эмоции от управления. Аккумуляторная мышь оснащена светодиодной RGB подсветкой которая переливается множеством цветов. `,
      image: '../assets/6.jpeg',
      image1: '../assets/6-1.jpeg',
      image2: '../assets/6-2.jpeg',
      image3: '../assets/6-3.jpeg',
      rating: 3,
      link: 'https://kaspi.kz/shop/p/ls-pro-chernyi-107622516/?c=750000000'
    },
    {
      id: 7,
      name: 'SSD Kingston SA400S37',
      price: 17990,
      description: `SSD-накопитель Kingston A400 имеет достаточно большую емкость (480 ГБ). Такого объема достаточно не только для установки операционной системы, но и для множества программ, а, возможно, и нескольких игр. Использование SSD сделает скорость работы системы в 10 раз выше, чем она была бы с HDD. Запуск компьютера будет занимать считанные секунды, файлы будут открываться и сохраняться быстрее. Ускорится даже загрузка файлов из Интернет, так как они будут записываться на накопитель практически мгновенно.
      Kingston A400 работает на базе контроллера Phison PS3111-S11 и использует чипы памяти TLC. Для подключения к материнской плате используется SATA III, питание подается через разъем 15 pin.`,
      image: '../assets/7.jpeg',
      image1: '../assets/7-1.jpeg',
      image2: '../assets/7-2.jpeg',
      image3: '../assets/7-3.jpeg',
      rating: 2,
      link: 'https://kaspi.kz/shop/p/ssd-kingston-sa400s37-480-gb-6800659/?c=750000000'
    },
    {
      id: 8,
      name: 'Xiaomi Mi Wi-Fi Router 4A',
      price: 10800,
      description: `Xiaomi Mi Router 4A Gigabit Edition даёт пользователю 1 гигабитный WAN-порт и 2 гигабитных LAN-порта, которые с лёгкостью осилят нагрузку в разы выше привычных 100 мегабит, при этом без единого разрыва и потери пакетов.
  
      Двухъядерный процессор гарантирует высокую скорость
      Сердцем роутера является двухъядерный процессор с частотой ядра до 880 МГц и поддержкой работы в четырехпоточном режиме. Именно благодаря его вычислительной мощности возможна поддержка гигабитных портов и не менее быстрая передача данных по двухчастотному Wi-Fi.`,
      image: '../assets/8.jpeg',
      image1: '../assets/8-1.jpeg',
      image2: '../assets/8-2.jpeg',
      image3: '../assets/8-3.jpeg',
      rating: 5,
      link: 'https://kaspi.kz/shop/p/wi-fi-router-xiaomi-mi-wi-fi-router-4a-gigabit-edition-100044713/?c=750000000'
    },
    {
      id: 9,
      name: 'Kingston SDCS2',
      price: 3779,
      description: `Карта памяти Kingston Canvas Select Plus − миниатюрная карта, обладающая производительностью класса A1, что делает ее идеальным приспособлением для использования в компьютерных устройствах, видео- и фотоаппаратуре. Объем карты microSDHC достигает 128 ГБ, что позволит записывать на нее достаточно много цифровой информации. Модель поддерживает совместимость с устройствами, функционирующими на Android.
  
      Kingston Canvas Select Plus поддерживает скорость чтения 100 Мбайт/сек, что обеспечивает более скоростную загрузку приложений. Модель отличается высокой прочностью, скоростью и производительностью, что позволяет использовать ее для обработки фотографий, имеющих высокое разрешение, а также для редактирования и съемки видео в Full HD. Изделие соответствует скоростному классу Class 10, UHS-I (U1) и поддерживает систему хранения файлов exFAT, благодаря чему достигается надежное хранение цифровой информации. Рабочая температура карты колеблется от -20° до +85°.`,
      image: '../assets/9.jpeg',
      image1: '../assets/9-1.jpeg',
      image2: '../assets/9-2.jpeg',
      image3: '../assets/9-3.jpeg',
      rating: 5,
      link: 'https://kaspi.kz/shop/p/kingston-sdcs2-128gb-128-gb-100081405/?c=750000000'
    },
    {
      id: 10,
      name: 'Apple MacBook Air 13',
      price: 2061,
      description: `Маленький чип. Грандиозный прорыв
      Первый чип, разработанный специально для Mac. Поразительно, но система на чипе Apple M1 вмещает 16 миллиардов транзис­торов и объединяет центральный и графи­ческий процессоры, систему Neural Engine, контроллеры ввода-вывода и множество других компонентов. Чип Apple M1 позволяет использовать на Mac уникальные технологии и обеспечивает невероятную производи­тельность в сочетании с лучшей в отрасли энергоэффективностью. Это не просто ещё один шаг для Mac — это принципиально новый уровень возможностей.
      
      8‑ядерный процессор. Дольше работает. Меньше ест
      По скорости вычислений чип M1 превосходит все другие процессоры Apple. Такая производительность позволяет выполнять на MacBook Air самые ресурсоёмкие задачи, например редактировать фото и видео на профессиональном уровне или играть в игры со сложной графикой.
      
      Но 8‑ядерный процессор в чипе M1 не просто работает до 3.5 раза быстрее по сравнению c предыдущим поколением процессоров — он рационально распределяет задачи между ядрами производительности и ядрами эффективности. Ядра эффективности легко справляются с повседневными действиями, расходуя при этом в десять раз меньше энергии.`,
      image: '../assets/10.jpeg',
      image1: '../assets/9-1.jpeg',
      image2: '../assets/9-2.jpeg',
      image3: '../assets/9-3.jpeg',
      rating: 5,
      link: 'https://kaspi.kz/shop/p/apple-macbook-air-13-mgn93-serebristyi-100798912/?c=750000000'
    },
  ];
  
  
  /*
  Copyright Google LLC. All Rights Reserved.
  Use of this source code is governed by an MIT-style license that
  can be found in the LICENSE file at https://angular.io/license
  */